const performances = [
  {
    id: 1,
    title: 'Гамлет',
    genre: 'Трагедія',
    time: '19:00',
    duration: 150,
    language: 'Українська',
    dates: ['2025-06-01', '2025-06-10', '2025-06-20'],
    shortDescription: 'Іконічна трагедія Вільяма Шекспіра про принца Данії.',
    longDescription: `«Гамлет» — це одна з найвідоміших трагедій Вільяма Шекспіра, яка досліджує теми помсти, зради, моралі та існування. Головний герой, принц Данії Гамлет, бореться із внутрішніми сумнівами після загадкової смерті батька та зрадою матері. П’єса розкриває складні людські почуття та психологічні конфлікти, що супроводжують процес прийняття важливих рішень. Режисери по всьому світу надихаються цією драмою для створення яскравих постановок, що залишають сильне враження на глядачів. У цій виставі особлива увага приділяється глибокій акторській грі та яскравим сценічним образам. Вона піднімає питання справедливості, влади і людської природи. Музика і сценографія створюють напружену атмосферу, яка занурює глядача у світ інтриг і переживань. «Гамлет» актуальний і сьогодні, адже торкається універсальних тем, що стосуються кожного. Вистава триватиме 2,5 години з антрактом, що дозволяє повністю поринути в сюжет. Запрошуємо вас відчути всю глибину шекспірівського генія на власні очі.`,
    image: '/images/hamlet.jpg',
    bookingImage: '/images/hamlet_booking.jpg',
    price: { min: 1200, max: 3500 }, 
    seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 3500 },
  { color: '#16a085', label: 'Ложа', price: 1850 },
  { color: '#566573', label: 'Головний зал', price: 1700 },
  { color: '#e67e22', label: 'Балкон', price: 1200 },
],
    hallConfig: {
      layout: 'semiCircle',
      balconies: 2,
      hasVip: true,
      hasLodges: true
    }
  },
  {
    id: 2,
    title: 'Знедолені',
    genre: 'Мюзикл',
    time: '18:30',
    duration: 180,
    language: 'Французька',
    dates: ['2025-06-05', '2025-06-12', '2025-06-26'],
    shortDescription: 'Епічна музична адаптація роману Віктора Гюго.',
    longDescription: `«Знедолені» — це емоційний мюзикл, що розповідає про боротьбу за свободу, справедливість та людську гідність у Франції XIX століття. Історія об’єднує долі різних персонажів — від бідняків до революціонерів, показуючи їхні надії та трагедії. Музика і постановка створюють глибокий емоційний резонанс, змушуючи глядачів задуматися над вічними темами добра і зла. Цей мюзикл відомий своєю масштабністю, вражаючими вокальними партіями і яскравими сценічними образами. Він занурює в атмосферу революційних подій, надаючи голос тим, хто прагне змінити світ. Постановка надихає на співчуття та розуміння людських страждань. Знедолені нагадують про силу надії навіть у найтемніші часи. Вистава триває три години з антрактом, що дозволяє повністю поринути у сюжет. Вона залишається однією з найулюбленіших музичних постановок у світі. Запрошуємо відчути музику та драму унікального мюзиклу.`,
    image: '/images/les-miserables.jpg',
    bookingImage: '/images/les-miserables_booking.jpg',
    price: { min: 500, max: 2000 },
    seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 2000 },
  { color: '#16a085', label: 'Ложа', price: 890 },
  { color: '#566573', label: 'Головний зал', price: 700 },
  { color: '#e67e22', label: 'Балкон', price: 500 },
],
    hallConfig: {
      layout: 'semiCircle',
      balconies: 3,
      hasVip: true,
      hasLodges: true
    }
  },
  {
    id: 3,
    title: 'Привид опери',
    genre: 'Мюзикл',
    time: '20:00',
    duration: 160,
    language: 'Англійська',
    dates: ['2025-06-03', '2025-06-17', '2025-06-29'],
    shortDescription: 'Містична історія кохання в Паризькій опері.',
    longDescription: `«Привид опери» — це захоплюючий мюзикл Ендрю Ллойда Веббера, який розповідає про таємничу та трагічну історію кохання між талановитою співачкою і загадковим привидом, що мешкає під оперним театром Парижа. Вистава поєднує драматичні сюжетні лінії, романтичні мелодії та містичну атмосферу. Особливу увагу приділено візуальним ефектам, що підсилюють напругу та емоційну глибину подій. Цей мюзикл став класикою світового театру, адже торкається теми пристрасті, ревнощів, творчості та боротьби зі своїми внутрішніми демонами.`,
    image: '/images/phantom.jpg',
    bookingImage: '/images/phantom-booking.jpg',
    price: { min: 900, max: 2500 },
    seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 2400 },
  { color: '#16a085', label: 'Ложа', price: 1500 },
  { color: '#566573', label: 'Головний зал', price: 1200 },
  { color: '#e67e22', label: 'Балкон', price: 900 },
],
    hallConfig: {
      layout: 'semiCircle',
      balconies: 2,
      hasVip: true,
      hasLodges: false
    }
  },
  {
    id: 4,
    title: 'Смерть комівояжера',
    genre: 'Драма',
    time: '19:30',
    duration: 135,
    language: 'Англійська',
    dates: ['2025-06-06', '2025-06-13', '2025-06-20'],
    shortDescription: 'Трагічна історія американської мрії.',
    longDescription: `«Смерть комівояжера» — це глибока і пронизлива драма Артура Міллера, яка розповідає про життя і трагедію Віллі Ломана — пересічного продавця, який намагається досягти успіху в американському суспільстві, але зіштовхується з нерозумінням, розчаруванням і власними ілюзіями. Вистава піднімає питання цінності людини, сімейних стосунків і сенсу успіху. Тема американської мрії та її темної сторони проходить червоною ниткою через весь сюжет. Глядачі занурюються в психологічні переживання героїв і їх боротьбу за гідність у складних життєвих обставинах.`,
    image: '/images/salesman.jpg',
    bookingImage: '/images/salesman-booking.jpg',
    price: { min: 300, max: 1300 },
        seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 1300 },
  { color: '#16a085', label: 'Ложа', price: 890 },
  { color: '#566573', label: 'Головний зал', price: 700 },
  { color: '#e67e22', label: 'Балкон', price: 300 },
],
    hallConfig: {
      layout: 'rectangle',
      balconies: 1,
      hasVip: false,
      hasLodges: false
    }
  },
  {
    id: 5,
    title: 'Трамвай "Бажання"',
    genre: 'Драма',
    time: '19:00',
    duration: 140,
    language: 'Українська',
    dates: ['2025-06-08', '2025-06-15', '2025-06-22'],
    shortDescription: 'Психологічна драма про ілюзії, втрати та пристрасть.',
    longDescription: `«Трамвай "Бажання"» — це інтенсивна психологічна драма Теннессі Вільямса, що розкриває життя двох жінок: Бланш Дюбуа і її сестри Стелли, а також їхні складні стосунки з чоловіком Стелли, Блічем. П’єса порушує теми ілюзій, насильства, любові і втрати, занурюючи глядача у світ внутрішніх конфліктів і глибоких емоцій. Ця вистава часто вражає своєю інтимністю та драматичною силою, змушуючи задуматись над природою людських страждань і прагнень.`,
    image: '/images/streetcar.jpg',
    bookingImage: '/images/streetcar-booking.jpg',
    price: { min: 350, max: 1200 },
        seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 1200 },
  { color: '#16a085', label: 'Ложа', price: 790 },
  { color: '#566573', label: 'Головний зал', price: 600 },
  { color: '#e67e22', label: 'Балкон', price: 350 },
],
    hallConfig: {
      layout: 'rectangle',
      balconies: 2,
      hasVip: false,
      hasLodges: true
    }
  },
  {
    id: 6,
    title: 'Як важливо бути серйозним',
    genre: 'Комедія',
    time: '18:00',
    duration: 120,
    language: 'Англійська',
    dates: ['2025-06-07', '2025-06-14', '2025-06-21'],
    shortDescription: 'Дотепна сатира Оскара Вайлда.',
    longDescription: `«Як важливо бути серйозним» — це блискуча комедія Оскара Вайлда, яка висміює соціальні норми, лицемірство та марнославство в англійському суспільстві кінця XIX століття. Через заплутані особисті інтриги, двозначності і дотепні діалоги, п’єса піднімає теми ідентичності, честі і любові. Легка, але в той же час глибока, ця вистава дарує глядачам море сміху та роздумів про те, що ж таке справжня серйозність у житті.`,
    image: '/images/earnest.jpg',
    bookingImage: '/images/earnest-booking.jpg',
    price: { min: 400, max: 1000 },
        seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 1000 },
  { color: '#16a085', label: 'Ложа', price: 590 },
  { color: '#566573', label: 'Головний зал', price: 900 },
  { color: '#e67e22', label: 'Балкон', price: 400 },
],
    hallConfig: {
      layout: 'rectangle',
      balconies: 1,
      hasVip: false,
      hasLodges: false
    }
  },
  {
    id: 7,
    title: 'Король Лір',
    genre: 'Трагедія',
    time: '20:00',
    duration: 160,
    language: 'Українська',
    dates: ['2025-06-09', '2025-06-18', '2025-06-27'],
    shortDescription: 'Трагедія про владу, зраду і батьківську любов.',
    longDescription: `«Король Лір» — одна з найвідоміших трагедій Шекспіра, що розповідає про падіння могутнього короля, який у пошуках любові і визнання від своїх дочок приймає фатальні рішення. Вистава розкриває теми влади, зради, божевілля і прощення. Глядачі спостерігають за драматичними подіями, що змушують задуматися про людську природу, мораль і сімейні цінності. Особлива увага приділяється інтенсивній акторській грі і постановці, яка підкреслює глибину трагедії.`,
    image: '/images/lear.jpg',
    bookingImage: '/images/lear-booking.jpg',
    price: { min: 600, max: 1600 },
        seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 1600 },
  { color: '#16a085', label: 'Ложа', price: 630 },
  { color: '#566573', label: 'Головний зал', price: 550 },
  { color: '#e67e22', label: 'Балкон', price: 600 },
],
    hallConfig: {
      layout: 'semiCircle',
      balconies: 2,
      hasVip: true,
      hasLodges: true
    }
  },
  {
    id: 8,
    title: 'Чекаючи на Годо',
    genre: 'Театр абсурду',
    time: '17:30',
    duration: 110,
    language: 'Французька',
    dates: ['2025-06-11', '2025-06-16', '2025-06-23'],
    shortDescription: 'Філософська п’єса про сенс життя.',
    longDescription: `«Чекаючи на Годо» — це знакова п’єса театру абсурду, написана Семюелем Беккетом. Вона розповідає про двох мандрівників, які чекають на загадкового Годо, що ніколи не приходить. Через діалоги, повні іронії, пауз та абсурду, вистава досліджує теми існування, безнадійності та пошуку сенсу життя. Вистава кидає виклик традиційним уявленням про драму, занурюючи глядача у філософські роздуми про час, надію і самотність.`,
    image: '/images/godot.jpg',
    bookingImage: '/images/godot-booking.jpg',
    price: { min: 200, max: 900 },
        seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 900 },
  { color: '#16a085', label: 'Ложа', price: 460 },
  { color: '#566573', label: 'Головний зал', price: 350 },
  { color: '#e67e22', label: 'Балкон', price: 200 },
],
    hallConfig: {
      layout: 'rectangle',
      balconies: 1,
      hasVip: false,
      hasLodges: false
    }
  },
  {
  id: 9,
  title: 'Отелло',
  genre: 'Трагедія',
  time: '19:45',
  duration: 155,
  language: 'Англійська',
  dates: ['2025-06-04', '2025-06-19', '2025-06-28'],
  shortDescription: `«Отелло» — Трагедія про руйнівну силу ревнощів і зради, що веде до фатального кінця.`,
  longDescription: "«Отелло» у цій постановці вирізняється глибоким психологізмом і сучасним трактуванням класичного тексту. Атмосфера спектаклю напружена, темна, з витонченими візуальними рішеннями та інтенсивною грою акторів. Особливу увагу приділено емоційним контрастам, вираженим через пластику тіла, світлові акценти та мінімалістичну сценографію. Яго постає не просто як зрадник, а як уособлення руйнівної сили слова. Ця постановка не тільки відображає драму особистості, але й ставить гострі питання про расизм, довіру і владу в сучасному світі.",
  image: '/images/othello.jpg',
  bookingImage: '/images/othello-booking.jpg',
  price: { min: 500, max: 1400 },
      seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 1400 },
  { color: '#16a085', label: 'Ложа', price: 1190 },
  { color: '#566573', label: 'Головний зал', price: 800 },
  { color: '#e67e22', label: 'Балкон', price: 500 },
],
  hallConfig: {
    layout: 'semiCircle',
    balconies: 2,
    hasVip: true,
    hasLodges: false
  }
},
{
  id: 10,
  title: 'Чайка',
  genre: 'Драма',
  time: '18:15',
  duration: 130,
  language: 'Російська',
  dates: ['2025-06-02', '2025-06-15', '2025-06-30'],
  shortDescription: `«Чайка» Антона Чехова — Драма про мистецтво, мрії та гіркоту розчарування в житті.`,
  longDescription: "Постановка «Чайки» вирізняється камерністю і глибокою інтимністю. Сцена трансформується у простір, де кожен погляд і кожне мовчання мають значення. Режисерська концепція фокусується на внутрішніх переживаннях персонажів, їхній вразливості та невиразному болю, що часто звучить голосніше за слова. Актори працюють у мінімалістичному просторі, створюючи майже кінематографічні образи, які тонко передають атмосферу розчарування і мрій. Музичне оформлення доповнює емоційний тон, залишаючи глядача з глибоким відлунням думок.",
  image: '/images/seagull.jpg',
  bookingImage: '/images/seagull-booking.jpg',
  price: { min: 50, max: 100 },
      seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 100 },
  { color: '#16a085', label: 'Ложа', price: 90 },
  { color: '#566573', label: 'Головний зал', price: 70 },
  { color: '#e67e22', label: 'Балкон', price: 50 },
],
  hallConfig: {
    layout: 'rectangle',
    balconies: 1,
    hasVip: false,
    hasLodges: false
  }
},
{
  id: 11,
  title: 'Макбет',
  genre: 'Трагедія',
  time: '19:00',
  duration: 145,
  language: 'Англійська',
  dates: ['2025-06-03', '2025-06-12', '2025-06-24'],
  shortDescription: `«Макбет» — Темна історія про жадобу влади, моральну деградацію і внутрішню боротьбу.`,
  longDescription: "Темна, гіпнотична атмосфера «Макбета» збудована на контрастах світла й тіні, гучних барабанах та мовчанні, що стискає душу. Постановка переносить глядача у світ містики, крові й тривоги. Тут сцени насильства поєднуються з хореографічною точністю, а персонажі рухаються, немов фігури на шахівниці долі. Особливий акцент зроблено на трансформації внутрішнього стану головного героя — від честі до божевілля. Видовище вражає не лише візуально, але й емоційно — це справжній катарсис через театр.", 
  image: '/images/macbeth.jpg',
  bookingImage: '/images/macbeth-booking.jpg',
  price: { min: 70, max: 170 },
      seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 170 },
  { color: '#16a085', label: 'Ложа', price: 89 },
  { color: '#566573', label: 'Головний зал', price: 110 },
  { color: '#e67e22', label: 'Балкон', price: 70 },
],
  hallConfig: {
    layout: 'semiCircle',
    balconies: 1,
    hasVip: true,
    hasLodges: false
  }
},
{
  id: 12,
  title: 'Ромео і Джульєтта',
  genre: 'Трагедія',
  time: '17:45',
  duration: 140,
  language: 'Італійська',
  dates: ['2025-06-06', '2025-06-17', '2025-06-25'],
  shortDescription: `«Ромео і Джульєтта» —  Безсмертна історія кохання, що розквітає попри ворожнечу і гине у трагедії.`,
  longDescription: "Ця постановка «Ромео і Джульєтти» — витончена поєднання класичного тексту з сучасною сценічною мовою. Декорації стилізовані під італійське місто епохи Ренесансу, з використанням яскравих кольорів і живої музики. Постановка грає на контрастах — юнацька легкість проти дорослого цинізму, чисте кохання проти соціальної ненависті. Актори вражають природністю і силою почуттів, особливо у сценах прощання і трагедії. Цей спектакль — емоційна подорож, яка залишає після себе віру в силу кохання, навіть коли воно приречене.", 
  image: '/images/romeo.jpg',
  bookingImage: '/images/romeo-booking.jpg',
  price: { min: 1000, max: 2500 },
      seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 2500 },
  { color: '#16a085', label: 'Ложа', price: 1678 },
  { color: '#566573', label: 'Головний зал', price: 1543 },
  { color: '#e67e22', label: 'Балкон', price: 1000 },
],
  hallConfig: {
    layout: 'semiCircle',
    balconies: 2,
    hasVip: true,
    hasLodges: true
  }
},
{
  id: 13,
  title: 'Фігаро',
  genre: 'Комедія',
  time: '18:30',
  duration: 125,
  language: 'Французька',
  dates: ['2025-06-05', '2025-06-14', '2025-06-26'],
  shortDescription: `«Фігаро» — Весела і гостра комедія про кмітливого слугу, який перехитрює знать`,
  longDescription: "«Фігаро» у цій версії — це справжнє свято театру. Енергія, ритм, жваві діалоги та візуальна винахідливість створюють яскраву комедійну виставу, яка змушує зал сміятися і захоплюватися. Стиль постановки — барочний, із насиченими костюмами, декоративною сценою і музичними номерами. Але за комічною формою приховується глибока сатира на суспільні стереотипи, владу і класову нерівність. Фігаро — не просто веселий слуга, а народний герой, символ свободи думки і людської гідності.", 
  image: '/images/figaro.jpg',
  bookingImage: '/images/figaro-booking.jpg',
  price: { min: 300, max: 900 },
      seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 900 },
  { color: '#16a085', label: 'Ложа', price: 560 },
  { color: '#566573', label: 'Головний зал', price: 853 },
  { color: '#e67e22', label: 'Балкон', price: 300 },
],
  hallConfig: {
    layout: 'rectangle',
    balconies: 1,
    hasVip: false,
    hasLodges: true
  }
},
{
  id: 14,
  title: 'Медея',
  genre: 'Трагедія',
  time: '20:15',
  duration: 135,
  language: 'Грецька',
  dates: ['2025-06-08', '2025-06-20', '2025-06-29'],
  shortDescription: `«Медея» — Давньогрецька трагедія про зраду, помсту і межі людських емоцій.`,
  longDescription: "Постановка «Медеї» — це монументальний емоційний вибух. Вона поєднує античну трагедію з сучасними театральними засобами — відеопроекціями, звуковими ландшафтами та фізичним театром. Медее дається глибоко трагічне і суперечливе обличчя: вона водночас мстива жінка і жертва зради. Простір сцени схожий на архаїчний храм, у якому відбувається ритуал очищення через кров. Спектакль ставить глядача перед моральною дилемою: чи виправдана помста, якщо зрада безмежна?", 
  image: '/images/medea.jpg',
  bookingImage: '/images/medea-booking.jpg',
  price: { min: 350, max: 950 },
      seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 900 },
  { color: '#16a085', label: 'Ложа', price: 623 },
  { color: '#566573', label: 'Головний зал', price: 700 },
  { color: '#e67e22', label: 'Балкон', price: 350 },
],
  hallConfig: {
    layout: 'semiCircle',
    balconies: 1,
    hasVip: true,
    hasLodges: false
  }
},
{
  id: 15,
  title: 'Котка на розпеченому даху',
  genre: 'Драма',
  time: '19:30',
  duration: 130,
  language: 'Англійська',
  dates: ['2025-06-07', '2025-06-16', '2025-06-30'],
  shortDescription: `«Котка на розпеченому даху» Теннессі Вільямса — Напружена драма про родинні та особисті конфлікти на межі вибуху.`,
  longDescription: "У постановці «Котки на розпеченому даху» в центрі уваги — мовчазна боротьба, приглушені емоції, накопичені образи. Сценографія стримана, майже стерильна, що контрастує з напруженими діалогами. Герої у цій версії намагаються вижити в родинній системі, де відвертість — це розкіш. Особливий акцент зроблено на психологічному напруженні між подружжям, яке не здатне ні зійтись, ні розійтись. Акторська гра стримана, але надзвичайно точна — кожен жест, кожен погляд важить більше за слова. Ця вистава — глибока драма про пошук правди в умовах брехні.", 
  image: '/images/cat.jpg',
  bookingImage: '/images/cat-booking.jpg',
  price: { min: 40, max: 110 },
      seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 110 },
  { color: '#16a085', label: 'Ложа', price: 89 },
  { color: '#566573', label: 'Головний зал', price: 60 },
  { color: '#e67e22', label: 'Балкон', price: 40 },
],
  hallConfig: {
    layout: 'rectangle',
    balconies: 3,
    hasVip: false,
    hasLodges: false
  }
},
{
  id: 16,
  title: 'Слуга двох панів',
  genre: 'Комедія',
  time: '17:00',
  duration: 115,
  language: 'Італійська',
  dates: ['2025-06-04', '2025-06-13', '2025-06-23'],
  shortDescription: `«Слуга двох панів» — Комедія положень про слугу, який заплутується у власних хитрощах.`,
  longDescription: "«Слуга двох панів» — яскрава, динамічна комедія в стилі dell’arte. Актори працюють у фізично насиченій манері, використовуючи маски, акробатику та імпровізацію. Спектакль побудовано на енергії, ритмі та постійному русі — глядач не має ані секунди спокою. Сюжетна плутанина та гумор базуються на швидкості реакції акторів і щільній взаємодії з публікою. Але за цією комедійною оболонкою — соціальна сатира, яка показує абсурдність суспільних ієрархій. Вистава піднімає настрій і залишає відчуття радості від справжнього театру.",
  image: '/images/servant.jpg',
  bookingImage: '/images/servant-booking.jpg',
  price: { min: 200, max: 800 },
      seatColors: [
  { color: '#5b2c6f', label: 'VIP Ложа', price: 800 },
  { color: '#16a085', label: 'Ложа', price: 590 },
  { color: '#566573', label: 'Головний зал', price: 370 },
  { color: '#e67e22', label: 'Балкон', price: 200 },
],
  hallConfig: {
    layout: 'rectangle',
    balconies: 1,
    hasVip: false,
    hasLodges: false
  }
}

];

export default performances;
